Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: This discards your unsaved changes and re-reads the file with the chosen settings.
fr: Cela rejette vos modifications non enregistrées et relit le fichier avec les paramètres choisis.
ko: 저장하지 않은 변경 사항을 취소하고 선택한 설정으로 파일을 다시 읽습니다.
tr: Bu, kaydedilmemiş değişikliklerinizi atar ve dosyayı seçilen ayarlarla yeniden okur.
vi: Thao tác này bỏ các thay đổi chưa lưu và đọc lại tệp với cài đặt đã chọn.
zh_hans: 此操作会丢弃未保存的更改，并按所选设置重新读取文件。
zh_hant: 此操作會捨棄未儲存的變更，並依所選設定重新讀取檔案。

source: Reorder Column
fr: Réorganiser la colonne
ko: 열 순서 변경
tr: Sütunu Yeniden Sırala
vi: Sắp xếp lại cột
zh_hans: 调整列顺序
zh_hant: 調整欄位順序

source: FALSE
fr: Faux

source: An external link wants to apply a filter: %@
fr: Un lien externe veut appliquer un filtre : %@
ko: 외부 링크에서 필터를 적용하려고 합니다: %@
tr: Harici bir bağlantı filtre uygulamak istiyor: %@
vi: Một liên kết bên ngoài muốn áp dụng bộ lọc: %@
zh_hans: 外部链接要应用筛选条件： %@
zh_hant: 有外部連結想要套用篩選： %@

source: Gray
fr: Gris
ko: 회색
tr: Gri
vi: Xám
zh_hans: 灰色
zh_hant: 灰色

source: ~/.pgpass has incorrect permissions (needs chmod 0600)
fr: ~/.pgpass a des permissions incorrectes (a besoin de chmod 0600)
ko: ~/.pgpass 권한이 올바르지 않음(chmod 0600 필요)
tr: ~/.pgpass yanlış izinlere sahip (chmod 0600 gerekli)
vi: ~/.pgpass có quyền không đúng (cần chmod 0600)
zh_hans: ~/.pgpass 权限不正确（需要 chmod 0600）
zh_hant: ~/.pgpass 權限不正確（需要 chmod 0600）

source: Date Range
fr: Intervalle de dates
ko: 날짜 범위
tr: Tarih Aralığı
vi: Khoảng thời gian
zh_hans: 日期范围
zh_hant: 日期範圍

source: Reload Tables
fr: Recharger les tableaux

source: Require confirmation or Touch ID before executing queries.
fr: Exiger une confirmation ou Touch ID avant d'exécuter des requêtes.
ko: 쿼리 실행 전에 확인 또는 Touch ID를 요구합니다.
tr: Sorguları çalıştırmadan önce onay veya Touch ID gerektirir.
vi: Yêu cầu xác nhận hoặc Touch ID trước khi thực thi truy vấn.
zh_hans: 执行查询前需要确认或 Touch ID。
zh_hant: 執行查詢前需要確認或 Touch ID。

source: This index needs a name.
fr: Cet index a besoin d'un nom.

source: Type changes
fr: Changements de type

source: Roll the transaction back to discard them, or commit it to keep them.
fr: Retournez la transaction pour les rejeter ou effectuez-la pour les conserver.

source: Raw
fr: Cru
ko: 원시
tr: Ham
vi: Thô
zh_hans: 原始
zh_hant: 原始

source: Select a dump this connection's engine wrote: %@.
fr: Sélectionnez un décompte que le moteur de cette connexion a écrit : %@.

source: Owner
fr: Propriétaire
ko: 소유자
tr: Sahip
vi: Chủ sở hữu
zh_hans: 拥有者
zh_hant: 擁有者

source: MCP Setup
fr: Configuration MCP
ko: MCP 설정
tr: MCP Kurulumu
vi: Thiết lập MCP
zh_hans: MCP 设置
zh_hant: MCP 設定

source: Detected
fr: Détecté
ko: 감지됨
tr: Algılandı
vi: Đã phát hiện
zh_hans: 已检测到
zh_hant: 已偵測到

source: Rules for this query result are not saved.
fr: Les règles pour ce résultat de requête ne sont pas enregistrées.

source: This engine cannot count rows for that table.
fr: Ce moteur ne peut pas compter les lignes de cette table.
ko: 이 엔진은 해당 테이블의 행 수를 셀 수 없습니다.
tr: Bu motor o tablonun satırlarını sayamıyor.
vi: Engine này không đếm được số dòng cho bảng đó.
zh_hans: 此引擎无法统计那张表的行数。
zh_hant: 此引擎無法統計那張資料表的列數。

source: Add to Favorites
fr: Ajouter aux favoris
ko: 즐겨찾기에 추가
tr: Sık Kullanılanlara Ekle
vi: Thêm vào Yêu thích
zh_hans: 添加到收藏
zh_hant: 加入我的最愛

# Failed at line %lld. %@
source: Failed at line %1$lld. %2$@
fr: Échec à la ligne %1$lld. %2$@
ko: 줄 %1$lld에서 실패했습니다. %2$@
tr: %lld. satırda başarısız oldu. %@
vi: Lỗi ở dòng %lld. %@
zh_hans: 第 %lld 行失败。%@
zh_hant: 第 %lld 行失敗。%@

source: Duration
fr: Durée
ko: 소요 시간
tr: Süre
vi: Thời lượng
zh_hans: 持续时间
zh_hant: 持續時間

source: Language %@
fr: Langue %@
ko: 언어 %@
tr: %@ dili
vi: Ngôn ngữ %@
zh_hans: 语言 %@
zh_hant: 語言 %@

source: List the maintenance operations this engine supports, such as VACUUM, ANALYZE, or OPTIMIZE.
fr: Listez les opérations de maintenance que ce moteur prend en charge, telles que VACUUM, ANALYSE ou OPTIMISER.
ko: 이 엔진이 지원하는 VACUUM, ANALYZE, OPTIMIZE 같은 유지 관리 작업을 나열합니다.
tr: Bu motorun desteklediği VACUUM, ANALYZE veya OPTIMIZE gibi bakım işlemlerini listeler.
vi: Liệt kê các thao tác bảo trì mà engine này hỗ trợ, chẳng hạn VACUUM, ANALYZE hoặc OPTIMIZE.
zh_hans: 列出该引擎支持的维护操作，例如 VACUUM、ANALYZE 或 OPTIMIZE。
zh_hant: 列出該引擎支援的維護作業，例如 VACUUM、ANALYZE 或 OPTIMIZE。

source: Relational
fr: Relationnel
ko: 관계형
tr: İlişkisel
vi: Quan hệ
zh_hans: 关系型
zh_hant: 關聯式

source: Remove folder
fr: Supprimer le dossier
ko: 폴더 제거
tr: Klasörü kaldır
vi: Xóa thư mục
zh_hans: 移除文件夹
zh_hant: 移除資料夾

source: Medium
fr: Moyen
ko: 중간
tr: Orta
vi: Trung bình
zh_hans: 中等
zh_hant: 中等

source: Moves the editor cursor to the statement that produced this result
fr: Déplace le curseur de l'éditeur vers l'instruction qui a produit ce résultat.
ko: 이 결과를 생성한 문으로 편집기 커서를 이동합니다
tr: Düzenleyici imlecini bu sonucu üreten ifadeye taşır
vi: Di chuyển con trỏ trình soạn thảo tới câu lệnh đã tạo ra kết quả này
zh_hans: 将编辑器光标移到生成此结果的语句
zh_hant: 將編輯器游標移到產生此結果的陳述式

source: AI access is disabled for this connection
fr: L'accès à l'IA est désactivé pour cette connexion.
ko: 이 연결에서는 AI 접근이 비활성화되어 있습니다
tr: Bu bağlantı için AI erişimi devre dışı
vi: Quyền truy cập AI bị tắt cho kết nối này
zh_hans: 此连接的 AI 访问已禁用
zh_hant: 此連線的 AI 存取已停用

source: All selected connections were skipped.
fr: Toutes les connexions sélectionnées ont été ignorées.
ko: 선택한 모든 연결을 건너뛰었습니다.
tr: Seçilen tüm bağlantılar atlandı.
vi: Tất cả kết nối đã chọn đã bị bỏ qua.
zh_hans: 所有选中的连接均已跳过。
zh_hant: 所有選取的連線都已略過。

source: Reading the source…
fr: Lecture de la source...

# Statement %lld of %lld
source: Statement %1$lld of %2$lld
fr: Déclaration %1$lld de %2$lld
ko: 전체 %2$lld개 중 %1$lld번째 SQL 문
tr: ifade %lld / %lld
vi: Câu lệnh %1$lld / %2$lld
zh_hans: 语句 %lld / %lld
zh_hant: 陳述式 %1$lld / %2$lld

source: The driver cannot write %lld new rows.
fr: Le pilote ne peut pas écrire %lld nouvelles lignes.

source: User that ran it
fr: Utilisateur qui l'a exécuté
ko: 실행한 사용자
tr: Çalıştıran kullanıcı
vi: Người dùng đã chạy nó
zh_hans: 运行它的用户
zh_hant: 執行它的使用者

source: The Cloud SQL Auth Proxy did not become ready in time: %@
fr: Le Cloud SQL Auth Proxy n'est pas devenu prêt à temps : %@
ko: Cloud SQL Auth Proxy가 제한 시간 내에 준비되지 않았습니다: %@
tr: Cloud SQL Auth Proxy zamanında hazır olmadı: %@
vi: Cloud SQL Auth Proxy không sẵn sàng kịp thời: %@
zh_hans: Cloud SQL Auth Proxy 未能及时就绪：%@
zh_hant: Cloud SQL Auth Proxy 未能及時就緒：%@

source: Authentication is required for this operation
fr: L'authentification est requise pour cette opération.
ko: 이 작업에는 인증이 필요합니다
tr: Bu işlem için kimlik doğrulama gerekiyor
vi: Thao tác này yêu cầu xác thực
zh_hans: 此操作需要身份验证
zh_hant: 這項操作需要身分驗證

source: Remote SQLite session disconnected. Click to reconnect.
fr: Session SQLite à distance déconnectée. Cliquez pour se reconnecter.

source: Delete to Beginning of Line
fr: Supprimer jusqu'au début de la ligne
ko: 줄 시작까지 삭제
tr: Satır Başına Kadar Sil
vi: Xoá đến đầu dòng
zh_hans: 删除到行首
zh_hant: 刪除到行首

source: AI-powered SQL completions appear as ghost text while typing. Press Tab to accept, Escape to dismiss.
fr: Les complétions SQL alimentées par l'IA apparaissent sous forme de texte fantôme pendant la saisie. Appuyez sur Tab pour accepter, Esc pour annuler.
ko: AI 기반 SQL 자동 완성이 입력하는 동안 고스트 텍스트로 표시됩니다. Tab 키를 눌러 적용하고 Escape 키를 눌러 닫으십시오.
tr: Yapay zeka destekli SQL tamamlamaları yazarken hayalet metin olarak görünür. Kabul etmek için Tab, kapatmak için Escape.
vi: Gợi ý SQL bằng AI xuất hiện dưới dạng văn bản mờ khi gõ. Nhấn Tab để chấp nhận, Escape để bỏ qua.
zh_hans: AI 驱动的 SQL 补全在输入时以虚影文本显示。按 Tab 接受，按 Escape 关闭。
zh_hant: AI 驅動的 SQL 補全會在輸入時以淡色文字顯示。按 Tab 接受，按 Escape 關閉。

source: No public key could be read from the identity file set for this host, and IdentitiesOnly yes allows no other key. Check the path, and that the file is an OpenSSH public key or has a .pub beside it.
fr: Aucune clé publique ne pouvait être lu du fichier d'identité défini pour cet hôte, et IdentitiesOnly oui ne permet aucune autre clé. Vérifiez le chemin et assurez-vous que le fichier est une clé publique OpenSSH ou qu'il a un .pub à côté.

source: Ask the engine for the plan of a statement and return both the raw plan text and, where TablePro can parse it, a node tree with costs and row estimates. Setting 'analyze' runs the statement for real, so an analyzed write needs tools:write and Safe Mode approval.
fr: Demandez à l'ordinateur de planifier une déclaration et retournez à la fois le texte brut du plan et, si TablePro peut le parser, un arbre de nœuds avec les coûts et les estimations des lignes. La définition de "analyser" exécute la déclaration en temps réel, donc une écriture analysée nécessite des outils : l'écriture et l'approbation en mode sûr.
ko: 엔진에 명령문의 실행 계획을 요청하여 원본 계획 텍스트와, TablePro가 해석할 수 있는 경우 비용 및 행 추정치를 담은 노드 트리를 함께 반환합니다. 'analyze'를 설정하면 명령문을 실제로 실행하므로, 분석되는 쓰기 작업에는 tools:write와 안전 모드 승인이 필요합니다.
tr: Motordan bir ifadenin planını ister ve hem ham plan metnini hem de TablePro'nun ayrıştırabildiği yerlerde maliyetler ve satır tahminleri içeren bir düğüm ağacı döndürür. 'analyze' ayarlandığında ifade gerçekten çalıştırılır, bu yüzden analiz edilen bir yazma işlemi tools:write ve Güvenli Mod onayı gerektirir.
vi: Hỏi engine về kế hoạch thực thi của một câu lệnh và trả về cả văn bản kế hoạch gốc lẫn, ở những nơi TablePro phân tích được, một cây node kèm chi phí và ước lượng số dòng. Đặt 'analyze' sẽ chạy câu lệnh thật, nên một thao tác ghi có phân tích cần tools:write và phê duyệt Chế độ an toàn.
zh_hans: 向引擎请求某条语句的执行计划，返回原始计划文本，并在 TablePro 能够解析时返回带有代价和行数估算的节点树。设置 'analyze' 会真正执行该语句，因此被分析的写操作需要 tools:write 和安全模式批准。
zh_hant: 向引擎請求某條陳述式的執行計畫，回傳原始計畫文字，並在 TablePro 能夠解析時回傳帶有成本和列數估算的節點樹。設定 'analyze' 會真正執行該陳述式，因此被分析的寫入操作需要 tools:write 和安全模式核准。

source: Select an element to read or edit its JSON.
fr: Sélectionnez un élément pour lire ou modifier son JSON.

source: Renew it to use Pro features again. Everything else keeps working.
fr: Rénouvelez-le pour utiliser à nouveau les fonctionnalités Pro. Tout le reste continue de fonctionner.
ko: Pro 기능을 다시 사용하려면 갱신하십시오. 나머지 기능은 계속 작동합니다.
tr: Pro özelliklerini yeniden kullanmak için yenileyin. Geri kalan her şey çalışmayı sürdürür.
vi: Hãy gia hạn để dùng lại các tính năng Pro. Mọi thứ khác vẫn hoạt động.
zh_hans: 续订即可再次使用 Pro 功能。其余功能照常使用。
zh_hant: 續訂即可再次使用 Pro 功能。其餘功能照常使用。

source: Save Table Template
fr: Enregistrer le modèle de table
ko: 테이블 템플릿 저장
vi: Lưu mẫu bảng
zh_hans: 保存表模板
zh_hant: 儲存資料表範本

source: %lld rows
fr: %lld lignes
ko: %lld개 행
tr: %lld satır
vi: %lld dòng
zh_hans: %lld 行
zh_hant: %lld 列

source: Include approximate row counts (default false)
fr: Inclure le nombre approximatif de lignes (par défaut faux)
ko: 대략적인 행 수 포함(기본값: false)
tr: Yaklaşık satır sayılarını dahil et (varsayılan false)
vi: Bao gồm số hàng ước tính (mặc định false)
zh_hans: 包含近似行数（默认 false）
zh_hant: 包含近似列數（預設為 false）

source: Imported connections use AWS IAM where the database has it enabled, and ask for a password where it does not.
fr: Les connexions importées utilisent AWS IAM lorsque la base de données l'a activée, et demandent un mot de passe lorsque ce n'est pas le cas.

source: Comparing only. Changes applied earlier stay in the target.
fr: Comparaison uniquement. Les modifications appliquées précédemment restent dans la cible.

source: Reorder Favorites
fr: Réorganiser les favoris

source: Send Message
fr: Envoyer un message
ko: 메시지 보내기
tr: Mesaj Gönder
vi: Gửi tin nhắn
zh_hans: 发送消息
zh_hant: 傳送訊息

source: Cannot Save Command
fr: Impossible d'enregistrer la commande
ko: 명령을 저장할 수 없음
tr: Komut kaydedilemiyor
vi: Không thể lưu lệnh
zh_hans: 无法保存命令
zh_hant: 無法儲存指令

# %d of %d
source: %1$d of %2$d
fr: %1$d de %2$d
ko: %1$d/%2$d
tr: %1$d / %2$d
vi: %1$d trên %2$d
zh_hans: 第%1$d个，共%2$d个
zh_hant: 第 %1$d 個，共 %2$d 個

source: Always 'dropped' on success
fr: Toujours "abandonné" sur le succès
ko: 성공 시 항상 'dropped'
tr: Başarılı olduğunda her zaman 'dropped'
vi: Luôn là 'dropped' khi thành công
zh_hans: 成功时始终为 'dropped'
zh_hant: 成功時一律為 'dropped'

source: Width
fr: Largeur
ko: 너비
tr: Genişlik
vi: Chiều rộng
zh_hans: 宽度
zh_hant: 寬度

source: New Query
fr: Nouvelle requête
ko: 새 쿼리
tr: Yeni Sorgu
vi: Truy vấn mới
zh_hans: 新建查询
zh_hant: 新增查詢

source: Splitting Column…
fr: Colonne de division...

source: Remote (Quack)
fr: À distance (Quack)
ko: 원격(Quack)
tr: Uzak (Quack)
vi: Từ xa (Quack)
zh_hans: 远程 (Quack)
zh_hant: 遠端 (Quack)

source: Every query you run is saved. Press %@ to search them and load one back into the editor.
fr: Chaque requête que vous exécutez est enregistrée. Appuyez sur %@ pour les rechercher et en charger une de retour dans l'éditeur.
ko: 실행한 모든 쿼리는 저장됩니다. %@을(를) 눌러 검색하고 편집기로 다시 불러오세요.
tr: Çalıştırdığınız her sorgu kaydedilir. Aramak ve birini düzenleyiciye geri yüklemek için %@ tuşlarına basın.
vi: Mọi truy vấn bạn chạy đều được lưu. Nhấn %@ để tìm và nạp lại một truy vấn vào trình soạn thảo.
zh_hans: 你运行的每条查询都会被保存。按 %@ 搜索它们，并将其中一条载回编辑器。
zh_hant: 你執行的每個查詢都會儲存。按 %@ 搜尋它們，並將其中一個載回編輯器。

source: %1$@, schema %2$@
fr: %1$@, schéma %2$@
ko: %1$@, 스키마 %2$@
tr: %1$@, şema %2$@
zh_hant: %1$@，綱要 %2$@

source: Materialized Views
fr: Vues matérialisées
ko: 구체화된 뷰
tr: Materyalize Görünümler
zh_hans: 物化视图
zh_hant: 具體化檢視表

source: New Type…
fr: Nouveau type...

source: Jump to lines
fr: Saute aux lignes
ko: 줄로 이동
tr: Satırlara git
vi: Nhảy tới dòng
zh_hans: 跳转到相应行
zh_hant: 跳至相應的行

source: Not signed in to GitHub Copilot
fr: Pas connecté à GitHub Copilot
ko: GitHub Copilot에 로그인되지 않음
tr: GitHub Copilot'a oturum açılmamış
vi: Chưa đăng nhập GitHub Copilot
zh_hans: 未登录 GitHub Copilot
zh_hant: 未登入 GitHub Copilot

source: TablePro has not looked up this table's key columns, so it cannot tell which row an edit would change.
fr: TablePro n'a pas cherché les colonnes clés de cette table, il ne peut donc pas déterminer quelle ligne une modification modifierait.
ko: TablePro가 이 테이블의 키 열을 조회하지 않아, 편집이 어떤 행을 바꾸는지 알 수 없습니다.
tr: TablePro bu tablonun anahtar sütunlarını sorgulamadı, bu yüzden bir düzenlemenin hangi satırı değiştireceğini bilemiyor.
vi: TablePro chưa tra cứu các cột khoá của bảng này, nên không biết một chỉnh sửa sẽ thay đổi dòng nào.
zh_hans: TablePro 尚未查询这张表的键列，因此无法判断一次编辑会改动哪一行。
zh_hant: TablePro 尚未查詢這張資料表的鍵欄位，因此無法判斷一次編輯會改動哪一列。

source: The query to review
fr: La requête à examiner
ko: 검토할 쿼리
tr: İncelenecek sorgu
vi: Truy vấn cần rà soát
zh_hans: 要审查的查询
zh_hant: 要審查的查詢

source: Truncated, read only
fr: Truncé, lecture seule
ko: 잘림, 읽기 전용
tr: Kısaltıldı, salt okunur
vi: Đã cắt bớt, chỉ đọc
zh_hans: 已截断，只读
zh_hant: 已截斷，唯讀

source: Modified:
fr: Modifié :
ko: 수정됨:
tr: Değiştirildi:
vi: Đã sửa đổi:
zh_hans: 修改时间：
zh_hant: 修改時間：

source: Last checked: %@
fr: Dernière vérification : %@

source: Structure, Drop, and Data options are configured per table in the table list.
fr: Les options Structure, Déploiement et Données sont configurées par table dans la liste des tables.
ko: 구조, 삭제 및 데이터 옵션은 테이블 목록에서 각 테이블별로 구성합니다.
vi: Tùy chọn Cấu trúc, Xóa và Dữ liệu được cấu hình cho từng bảng trong danh sách bảng.
zh_hans: 结构、删除和数据选项在表列表中按表单独配置。
zh_hant: 結構、刪除與資料選項會在資料表清單中針對每個資料表個別設定。

source: Put field names in the first row
fr: Mettez les noms des champs dans la première ligne.
ko: 첫 번째 행에 필드 이름 포함
vi: Đặt tên trường ở dòng đầu tiên
zh_hans: 将字段名放在第一行
zh_hant: 將欄位名稱放在第一列

source: cloudflared was not found. Install it with “brew install cloudflared”, or set its path in the connection's Cloudflare Tunnel settings.
fr: cloudflared n'a pas été trouvé. Installez-le avec "brew install cloudflared", ou définissez son chemin dans les paramètres du tunnel Cloudflare de la connexion.
ko: cloudflared를 찾을 수 없습니다. “brew install cloudflared”로 설치하거나 연결의 Cloudflare Tunnel 설정에서 경로를 지정하십시오.
tr: cloudflared bulunamadı. “brew install cloudflared” ile yükleyin veya bağlantının Cloudflare Tüneli ayarlarında yolunu belirtin.
vi: Không tìm thấy cloudflared. Cài đặt bằng “brew install cloudflared”, hoặc đặt đường dẫn trong cài đặt Cloudflare Tunnel của kết nối.
zh_hans: 未找到cloudflared。请使用“brew install cloudflared”安装，或在该连接的Cloudflare隧道设置中设置其路径。
zh_hant: 找不到 cloudflared。請使用 “brew install cloudflared” 安裝，或在該連線的 Cloudflare 隧道設定中設定其路徑。

source: 10,000 rows
fr: 10 000 lignes
ko: 10,000개 행
tr: 10.000 satır
vi: 10.000 dòng
zh_hans: 10,000 行
zh_hant: 10,000 列

source: Draft a data quality audit
fr: Élaborer un audit de la qualité des données
ko: 데이터 품질 감사 초안 작성
tr: Bir veri kalitesi denetimi taslağı hazırla
vi: Soạn một bản kiểm định chất lượng dữ liệu
zh_hans: 起草一份数据质量审计
zh_hant: 草擬一份資料品質稽核

source: Open Quickly
fr: Ouvrir rapidement
ko: 빠르게 열기
tr: Hızlı Aç
vi: Mở nhanh
zh_hans: 快速打开
zh_hant: 快速打開

source: Boolean
fr: Booléen
ko: 불리언
zh_hans: 布尔值
zh_hant: 布林值

source: The target has no time zone on this type, so the offset is dropped.
fr: La cible n'a pas de fuseau horaire sur ce type, donc l'écart est supprimé.

source: No saved selections
fr: Aucune sélection enregistrée

source: Open Cursor, go to Settings > MCP
fr: Ouvrez le curseur, allez dans Paramètres > MCP
ko: Cursor를 열고 설정 > MCP로 이동하십시오
tr: Cursor'ı açın, Settings > MCP'ye gidin
vi: Mở Cursor, vào Settings > MCP
zh_hans: 打开 Cursor，进入 Settings > MCP
zh_hant: 開啟 Cursor，前往 Settings > MCP

source: The operation was cancelled.
fr: L'opération a été annulée.

source: This sets 1 loaded row. Review and Save to apply.
fr: Cela définit une ligne chargée. Réviser et enregistrer pour appliquer.
ko: 불러온 행을 1개로 설정합니다. 적용하려면 검토한 후 저장하십시오.
tr: Bu, yüklenmiş 1 satırın değerini ayarlar. Uygulamak için gözden geçirip kaydedin.
vi: Thao tác này đặt giá trị cho 1 hàng đã tải. Xem lại và Lưu để áp dụng.
zh_hans: 这将设置 1 个已加载的行。请检查后保存以应用。
zh_hant: 這會設定 1 列已載入的資料。請檢查後儲存以套用。

source: Set Cells to Value
fr: Définir les cellules en valeur

source: Replace the estimate with an exact row count.
fr: Remplacez l'estimation par un nombre exact de lignes.
ko: 추정치를 정확한 행 수로 바꿉니다.
tr: Tahmini, tam satır sayısıyla değiştirir.
vi: Thay ước tính bằng số dòng chính xác.
zh_hans: 用精确行数替换估算值。
zh_hant: 用精確列數取代估算值。

source: Collation or character set change
fr: Changement de collation ou de jeu de caractères
ko: 콜레이션 또는 문자 집합 변경
tr: Karşılaştırma veya karakter kümesi değişikliği
vi: Thay đổi đối chiếu hoặc bộ ký tự
zh_hans: 排序规则或字符集更改
zh_hant: 定序或字集變更

source: A foreign key needs as many referenced columns as it has columns.
fr: Une clé étrangère a besoin autant de colonnes référencées qu'elle en a de colonnes.

source: Database List
fr: Liste de la base de données
ko: 데이터베이스 목록
tr: Veritabanı Listesi
vi: Danh sách cơ sở dữ liệu
zh_hans: 数据库列表
zh_hant: 資料庫清單

source: Writes wait for you
fr: Écrits attendent pour vous

source: Insert rows the target is missing
fr: Insérer des lignes qui manquent dans la cible.
ko: 대상에 없는 행 삽입
tr: Hedefte eksik olan satırları ekle
vi: Chèn các dòng mà đích còn thiếu
zh_hans: 插入目标中缺少的行
zh_hant: 插入目標中缺少的列

source: Nothing selected.
fr: Rien sélectionné.

source: Alias Type
fr: Type d'alias

source: Delete Columns
fr: Supprimer les colonnes
ko: 열 삭제
tr: Sütunları Sil
vi: Xóa cột
zh_hans: 删除列
zh_hant: 刪除欄位

source: Invalid endpoint: %@
fr: Point d'extrémité invalide : %@
ko: 잘못된 엔드포인트: %@
tr: Geçersiz uç nokta: %@
vi: Endpoint không hợp lệ: %@
zh_hans: 无效的 Endpoint: %@
zh_hant: 無效的 Endpoint：%@

source: 1 statement would destroy data and is not allowed yet.
fr: 1 déclaration détruirait les données et n'est pas encore autorisée.
ko: 구문 1개가 데이터를 파괴하며 아직 허용되지 않았습니다.
tr: 1 ifade veriyi yok eder ve henüz izin verilmedi.
vi: 1 câu lệnh sẽ hủy dữ liệu và chưa được cho phép.
zh_hans: 1 条语句会销毁数据，尚未被允许。
zh_hant: 1 條陳述式會銷毀資料，尚未被允許。

source: %1$@ between “%2$@” and “%3$@”
fr: %1$@ entre "%2$@" et "%3$@"

source: Required (skip verify)
fr: Requis (supprimer la vérification)
ko: 필수(인증서 검증 건너뛰기)
tr: Zorunlu (doğrulamayı atla)
vi: Bắt buộc (bỏ qua xác minh)
zh_hans: 必需（跳过验证）
zh_hant: 必要（略過驗證）

source: This library's own project publishes no license file, so TablePro cannot state one for it. It is listed here so the gap stays visible instead of looking settled.
fr: Le propre projet de cette bibliothèque ne publie aucun fichier de licence, donc TablePro ne peut pas en déclarer un pour elle. Elle est répertoriée ici afin que l'écart reste visible au lieu d'avoir l'air réglé.
ko: 이 라이브러리의 프로젝트 자체가 라이선스 파일을 공개하지 않아 TablePro가 라이선스를 밝힐 수 없습니다. 해결된 것처럼 보이지 않도록 이 공백을 드러내기 위해 여기에 표시합니다.
tr: Bu kitaplığın kendi projesi bir lisans dosyası yayımlamıyor, bu yüzden TablePro onun için bir lisans belirtemiyor. Bu boşluk çözülmüş gibi görünmesin diye burada listeleniyor.
vi: Dự án của chính thư viện này không công bố tệp giấy phép, nên TablePro không thể nêu ra giấy phép cho nó. Nó được liệt kê ở đây để khoảng trống này vẫn hiện rõ thay vì trông như đã xong.
zh_hans: 该库自己的项目没有发布许可证文件，因此 TablePro 无法为它指明许可证。把它列在这里，是为了让这个空缺保持可见，而不是看起来已经解决。
zh_hant: 該程式庫自己的專案沒有發布授權檔案，因此 TablePro 無法為它指明授權。把它列在這裡，是為了讓這個空缺保持可見，而不是看起來已經解決。

source: Dropping materialized view %@ discards its stored rows along with its indexes, comments and privileges.
fr: Le dépôt d'une vue matérialisée %@ rejette ses lignes stockées ainsi que ses index, commentaires et privilèges.

source: Stop keeping this plan when history is cleaned up
fr: Arrêtez de garder ce plan quand l'histoire sera nettoyée.
ko: 기록을 정리할 때 이 플랜을 더 이상 유지하지 않음
tr: Geçmiş temizlenirken bu planı artık saklama
vi: Không giữ kế hoạch này khi dọn dẹp lịch sử
zh_hans: 清理历史记录时不再保留此计划
zh_hant: 清理歷史記錄時不再保留此計劃

source: Choose your client and follow the steps to connect it to TablePro.
fr: Choisissez votre client et suivez les étapes pour le connecter à TablePro.
ko: 클라이언트를 선택하고 단계에 따라 TablePro에 연결하십시오.
tr: İstemcinizi seçin ve TablePro'ya bağlamak için adımları izleyin.
vi: Chọn client của bạn và làm theo các bước để kết nối với TablePro.
zh_hans: 选择您的客户端并按步骤将其连接到TablePro。
zh_hant: 選擇你的用戶端，並依照步驟將它連線到 TablePro。

source: %@ cannot be empty
fr: %@ ne peut pas être vide
ko: %@ 필드는 비워 둘 수 없습니다
tr: %@ cannot be boş
vi: %@ không được để trống
zh_hans: %@ 不能为空
zh_hant: %@ 不能為空白

source: Sign in with xAI
fr: Connectez-vous avec xAI
ko: xAI로 로그인
tr: xAI ile giriş yap
vi: Đăng nhập bằng xAI
zh_hans: 使用 xAI 登录
zh_hant: 使用 xAI 登入

source: This connection runs SQL every time it connects, using your credentials.
fr: Cette connexion exécute SQL chaque fois qu'elle se connecte, en utilisant vos identifiants.
ko: 이 연결은 연결될 때마다 사용자의 자격 증명으로 SQL을 실행합니다.
tr: Bu bağlantı her bağlandığında, kimlik bilgilerinizle SQL çalıştırır.
vi: Kết nối này chạy SQL mỗi lần kết nối, bằng thông tin đăng nhập của bạn.
zh_hans: 此连接每次连接时都会用你的凭据运行 SQL。
zh_hant: 此連線每次連線時都會用你的憑證執行 SQL。

source: Terminate Session
fr: Terminer la session
ko: 세션 종료
tr: Oturumu Sonlandır
vi: Kết thúc phiên
zh_hans: 终止会话
zh_hant: 終止工作階段

source: Toggle Filters (Cmd+F)
fr: Changer les filtres (Cmd+F)
ko: 필터 표시/숨기기(Cmd+F)
vi: Bật/tắt bộ lọc (Cmd+F)
zh_hans: 切换筛选 (Cmd+F)
zh_hant: 切換篩選 (Cmd+F)

source: Objects that depend on them will be dropped too.
fr: Les objets qui en dépendent seront également perdus.
ko: 종속된 객체도 함께 삭제됩니다.
tr: Onlara bağımlı nesneler de silinecek.
vi: Các đối tượng phụ thuộc vào chúng cũng sẽ bị xoá.
zh_hans: 依赖它们的对象也会被删除。
zh_hant: 依賴它們的物件也會被刪除。

source: Matching ignores case
fr: L'appariement ignore la casse.
ko: 일치 시 대/소문자 무시
tr: Eşleştirme büyük/küçük harfe duyarsız
vi: So khớp không phân biệt hoa thường
zh_hans: 匹配时忽略大小写
zh_hant: 比對時忽略大小寫

source: Registry
fr: Salle des registres
ko: 레지스트리
vi: Kho plugin
zh_hans: 插件仓库
zh_hant: 外掛註冊

source: Open JSON Viewer
fr: Ouvrir le Visualiseur JSON
ko: JSON 뷰어 열기
tr: JSON Görüntüleyiciyi Aç
vi: Mở trình xem JSON
zh_hans: 打开 JSON 查看器
zh_hant: 開啟 JSON 檢視器

source: Second value is required for BETWEEN
fr: La deuxième valeur est requise pour ENTRE
ko: BETWEEN에는 두 번째 값이 필요합니다
tr: BETWEEN için ikinci değer gereklidir
vi: Giá trị thứ hai là bắt buộc cho BETWEEN
zh_hans: BETWEEN 需要第二个值
zh_hant: BETWEEN 需要第二個值

source: Foreign key points at a column that does not exist: %@
fr: Points clés étrangers à une colonne qui n'existe pas : %@
